{"scoring":"Эта задача состоит из двух подзадач. Для некоторых подзадач выполняются дополнительные ограничения, указанные в таблице ниже. Для получения баллов за подзадачу необходимо пройти все тесты данной подзадачи, а также все тесты всех необходимых подзадач. Необходимые подзадачи также указаны в таблице.\r\n\r\n\\begin{center}\r\n\\begin{tabular}{|c|c|p{0.4\\textwidth}|c|}\r\n\\hline\r\n\\textbf{Подзадача} & \r\n\\textbf{Баллы} & \r\n\\textbf{Ограничения} & \r\n\\parbox{3cm}{\\textbf{\\centering\\\\Необходимые\\\\подзадачи\\\\\\vspace{2mm}}} \r\n\\\\ \\hline\r\n1  & 47 & $n \\le 1\\,000$ &\r\n\\\\ \\hline\r\n2  & 53 & Без дополнительных ограничений & 1\r\n\\\\ \\hline\r\n\\end{tabular}\r\n\\end{center}\r\n\r\n","notes":"","legend":"Кэрол Дэнверс, известная как Капитан Марвел противодействует флоту Скруллов. Каждый из кораблей Скруллов имеет\r\nопределенную мощность, выраженную натуральным числом.\r\n\r\nКэрол считает, что настолько сильна, что может не только вывести из строя флот, но и немного развлечься. Внимательно изучив мощность корабля, она решила, что будет выводить их из строя в следующем порядке: каждый раз Кэрол будет атаковать тот \r\nкорабль из неатакованных ранее, мощность которого является медианой мощностей оставшихся кораблей.\r\n\r\nМедиану ряда чисел Кэрол вычисляет следующим образом:\r\n\\begin{itemize}\r\n  \\item Если количество чисел в ряду нечетно, то медиана~--- число, стоящее посередине   упорядоченного по возрастанию данного ряда. \r\n  \\item Если количество чисел в ряду чётно, то медианой ряда является:\r\n  \\begin{itemize}\r\n  \\item Меньшее из двух стоящих посередине чисел упорядоченного по возрастанию данного ряда, если два средних различны.\r\n  \\item Любое из двух стоящих посередине чисел упорядоченного по возрастанию данного ряда, если два средних равны.\r\n  \\end{itemize}\r\n\\end{itemize}\r\n\r\nПомогите Капитану Марвел посчитать порядок, в котором нужно атаковать корабли.\r\n\r\n","authorLogin":"gshark","language":"russian","timeLimit":2000,"output":"Выведите $n$ чисел~--- мощности кораблей в том порядке, в котором Кэрол будет их атаковать.","inputFile":"stdin","outputFile":"stdout","input":"В первой строке дано одно натуральное число $n$~--- число кораблей во флоте Скруллов ($1 \\le n \\le 10^5$).\r\n\r\nВо второй строке содержатся $n$ натуральных чисел $a_i$~--- мощность $i$-го корабля ($1 \\le a_i \\le 10^9$).\r\n","authorName":"Grigory Shovkoplyas","sampleTests":[{"output":"8 3 19 \r\n","input":"3\r\n8 3 19\r\n","inputFile":"example.01","outputFile":"example.01.a"},{"output":"2 2 1 4 \r\n","input":"4\r\n4 2 2 1\r\n","inputFile":"example.02","outputFile":"example.02.a"}],"name":"Ослабление флота","interaction":null,"memoryLimit":268435456,"tutorial":"Решение на \\textbf{47 баллов}: Напишем ровно то, что просят в условии. $n$ раз будем искать медиану в массиве, после чего удалять ее, получая новый массив. Как найти медиану?\r\nЕсть два способа:\r\n\\begin{itemize}\r\n\\item Отсортировать массив за $O(n \\log n)$, тогда медианой, очевидно, будет $\\frac{n}{2}$-й элемент. Итоговая сложность решения будет $O(n^2 \\log n)$.\r\n\\item Воспользоваться алгоритмом поиска к-ой порядковой статистики, который работает за $O(n)$, а также реализован в стандартной библиотеке в некоторых языках. Итоговая сложность решения будет $O(n^2)$.\r\n\\end{itemize}\r\n\r\n\r\nДля решения на \\textbf{100 баллов} заметим, что можно модифицировать первый способ решения предыдущей подгруппы. После того, как мы отсортировали массив и удалим медиану, следующая медиана это соседний элемент от удаленного. Таким образом, достаточно отсортировать массив ровно один раз, после чего с помощью метода двух указателей пройтись по нему и вывести нужные элементы.\r\n\r\nДля удобства можно отдельно рассмотреть случай нечетной длины. Итоговая сложность данного решения $O(n \\log n)$."}