{"scoring":"Эта задача состоит из четырех подзадач. Для некоторых подзадач выполняются дополнительные ограничения, указанные в таблице ниже. Для получения баллов за подзадачу необходимо пройти все тесты данной подзадачи, а также все тесты всех необходимых подзадач. Необходимые подзадачи также указаны в таблице.\r\n\r\n\\begin{center}\r\n\\begin{tabular}{|c|c|p{0.4\\textwidth}|c|}\r\n\\hline\r\n\\textbf{Подзадача} & \r\n\\textbf{Баллы} & \r\n\\textbf{Ограничения} & \r\n\\parbox{3cm}{\\textbf{\\centering\\\\Необходимые\\\\подзадачи\\\\\\vspace{2mm}}} \r\n\\\\ \\hline\r\n1  & 21 & $|s| \\le 12$. Также известно, что $d = 1$. &\r\n\\\\ \\hline\r\n2  & 22 & $|s| \\le 10^5$. Также известно, что $d = 1$ & 1\r\n\\\\ \\hline\r\n3  & 32 & $|s| \\le 1000$ & 1\r\n\\\\ \\hline\r\n4  & 25 & Без дополнительных ограничений & 1, 2, 3\r\n\\\\ \\hline\r\n\\end{tabular}\r\n\\end{center}\r\n\r\nВ первых двух подзадачах гарантируется, что нельзя декодировать строку для $d \\ne 1$.\r\n\r\n","notes":"В первом примере закодированную строку можно получить из <<\\texttt{b}>>, если $d = 8$, а также из <<\\texttt{X}>>, если $d = 9$.\r\n\r\nВо втором примере закодированную строку можно получить только из <<\\texttt{dZ}>> при $d = 5$.","legend":"Во время последней секретной операции Капитану Марвел удалось выкрасть закодированное секретное сообщение скруллов~--- строку $s$. Однако, в закодированном виде никакой полезной информации оно из себя не представляет, поэтому его непременно нужно раскодировать.\r\n\r\nНесмотря на развитость скруллов, их система кодирования сообщений проста и общеизвестна: \\begin{itemize}\r\n\\item Перед кодированием сообщения выбирается цифра $d$ ($0 \\le d \\le 9$)\r\n\\item Символы сообщения рассматриваются слева направо\r\n\\item У каждого символа сообщения вычисляется его ASCII-код (например, у <<\\texttt{a}>> он равен $97$, у <<\\texttt{b}>>~--- $98$, у <<\\texttt{z}>>~--- $122$)\r\n\\item Если код трехзначный, он дописывается к текущей закодированной строке как есть, если же код двузначный, к нему в случайное место добавляется цифра $d$ и полученный результат дописывается к текущей закодированной строке (например, если $d = 3$, а текущая буква~--- <<\\texttt{a}>>, к текущей закодированной строке могут дописатсья числа $397$, $937$ или $973$)\r\n\\item После обработки всех букв, результатом считается полученная закодированная строка\r\n\\end{itemize}\r\n\r\nЧисло $d$ обычно передается вместе с сообщением, но Капитану Марвел не удалось его найти. Однако, она точно знает, что исходное сообщение состояло только из строчных и заглавных латинских букв. Она понимает, что без числа $d$ раскодировать сообщение однозначно может не получиться, поэтому для начала хочет посчитать, сколько существует различных строк $t$, состоящих из строчных и заглавных латинских букв, таких, что, закодировав их, получится строка $s$. Так как наша героиня не может быть полностью уверена, что сообщение было перехвачено полностью, вполне возможно, что его невозможно декодировать ни одним способом.\r\n\r\nПомогите нашей героине~--- найдите количество этих строк по модулю $10^9 + 7$.","authorLogin":"DimaPhil","language":"russian","timeLimit":2000,"output":"В единственной строке выведите одно число~--- количество различных строк, состоящих из строчных и заглавных латинских букв, которые кодируются в строку $s$, по модулю $10^9 + 7$.","inputFile":"stdin","outputFile":"stdout","input":"В единственной строке содержится закодированная строка $s$, выкраденная Капитаном Марвел ($3 \\le |s| \\le 10^5$). Гарантируется, что строка $s$ состоит только из цифр, а также что ее длина кратна~$3$.","authorName":"Dmitry Philippov","sampleTests":[{"output":"2\r\n","input":"988\r\n","inputFile":"example.01","outputFile":"example.01.a"},{"output":"1\r\n","input":"100905\r\n","inputFile":"example.02","outputFile":"example.02.a"},{"output":"0\r\n","input":"600\r\n","inputFile":"example.03","outputFile":"example.03.a"}],"name":"Декодирование сообщения","interaction":null,"memoryLimit":268435456,"tutorial":"Общее замечание: так как каждый символ исходной строки кодируется в трехзначное число, строку $s$ можно разбить на последовательные блоки из $3$ цифр, каждый из которых будет соответствовать закодированной букве.\r\n\r\nРешение на \\textbf{21} балл: Так как длина искомой исходной строки не превосходит $\\frac{12}{3} = 4$, достаточно перебрать все возможные исходные строки (их не больше $(26 + 26)^4 = 52^4 < 10^7$. Для каждой строки останется только проверить, что с помощью $d = 1$ ее можно закодировать в строку $s$.\r\n\r\nРешение на \\textbf{43} балла: Заметим, что разные блоки из $3$ цифр в строке $s$ независимы, таким образом, достаточно для каждого блока $b$ найти все возможные символы $c$, которые при $d = 1$ можно закодировать в $b$, а после этого перемножить эти количества для всех блоков.\r\n\r\nРешение на \\textbf{75-100} баллов: Заметим, что каким бы ни было число $d$, из двузначного кода символа нельзя получить число в диапазоне $[100, 122]$ (соответствующего диапазону символов [<<\\texttt{d}>>..<<\\texttt{z}>>]. Соответственно, эти символы декодируются однозначно.\r\n\r\nТеперь переберем число $d$, а затем для каждого блока из $3$ цифр в $s$ найдем все возможные символы исходной строки, которые могут соответствовать этому блоку (это можно сделать за $O(1)$, достаточно попробовать удалить из блока каждую из трех цифр, а затем проверить, что оставшееся число находится либо в отрезке [$65$, $90$], либо в отрезке [$97$, $99$]). Все эти количества для фиксированного $d$ опять же перемножим между собой и добавим к ответу.\r\n\r\nВ зависимости от оптимальности реализации этого алгоритма можно было получить либо $75$, либо $100$ баллов.\r\n"}