{"scoring":"Эта задача состоит из двух подзадач. Для некоторых подзадач выполняются дополнительные ограничения, указанные в таблице ниже. Для получения баллов за подзадачу необходимо пройти все тесты данной подзадачи, а также все тесты всех необходимых подзадач. Необходимые подзадачи также указаны в таблице.\r\n\r\n\\begin{center}\r\n\\begin{tabular}{|c|c|p{0.4\\textwidth}|c|}\r\n\\hline\r\n\\textbf{Подзадача} & \r\n\\textbf{Баллы} & \r\n\\textbf{Ограничения} & \r\n\\parbox{3cm}{\\textbf{\\centering\\\\Необходимые\\\\подзадачи\\\\\\vspace{2mm}}} \r\n\\\\ \\hline\r\n1  & 51 & $w, a_i, b_j \\le 1\\,000$; $n, m \\le 1\\,000$ &\r\n\\\\ \\hline\r\n2  & 49 & Без дополнительных ограничений & 1\r\n\\\\ \\hline\r\n\\end{tabular}\r\n\\end{center}\r\n\r\n","notes":"В тесте из примера рулон можно разделить на две части, проведя черту между 7 и 8 столбцом клеток, а затем записать по два слова в каждой строке в обеих частях  рапорта.","legend":"Верс нужно подготовить рапорт о последнем боевом вылете. Она уже сочинила в голове текст, осталось лишь его записать. Рапорт будет состоять из двух частей: первая будет содержать $n$ слов, $i$-е из которых состоит из $a_i$ букв, вторая \"--- $m$ слов, $j$-е из которых состоит из $b_j$ букв. Язык Крии не содержит никаких знаков препинания. Верс должна записать рапорт на клетчатом рулоне бумаги, шириной $w$ клеток. Так как рапорт состоит из двух частей, она разделит вертикальной чертой рулон на две части целой ширины, после чего в левой части напишет первую часть, а в правой \"--- вторую.\r\n\r\nОбе части рапорта записываются аналогично, каждая на своей части рулона. Одна буква слова занимает ровно одну клетку. Первое слово записывается в первой строке рулона, начиная с самой левой клетки этой части рулона. Каждое следующее слово, если это возможно, должно быть записано в той же строке, что и предыдущее, и быть отделено от него ровно одной пустой клеткой. Иначе, оно пишется в следующей строке, начиная с самой левой клетки. Если ширина части рулона меньше, чем длина какого-то слова, которое должно быть написано в этой части, написать эту часть рапорта на части рулона такой ширины невозможно.\r\n\r\nГарантируется, что можно провести вертикальную черту так, что обе части рапорта возможно написать.\r\nВерс хочет провести вертикальную черту так, чтобы длина рулона, которой хватит, чтобы написать рапорт, была минимальна. Помогите ей найти эту минимальную длину.","authorLogin":"BudAlNik","language":"russian","timeLimit":2000,"output":"В единственной строке выведите одно целое число \"--- минимальную длину рулона, которой достаточно, чтобы написать рапорт.","inputFile":"stdin","outputFile":"stdout","input":"В первой строке даны три целых числа $w$, $n$ и $m$ \"--- ширина рулона, количество слов в первой и второй части рапорта ($1 \\le w \\le 10^9$; $1 \\le n, m \\le 100\\,000$).\r\n\r\nВ следующей строке дано $n$ целых чисел $a_i$ \"--- длина $i$-го слова первой части рапорта $1 \\le a_i \\le 10^9$.\r\n\r\nВ следующей строке дано $m$ целых чисел $b_j$ \"--- длина $j$-го слова второй части рапорта $1 \\le b_j \\le 10^9$.\r\n\r\nГарантируется, что возможно провести черту так, что обе части рапорта возможно написать.","authorName":"Nikolay Budin","sampleTests":[{"output":"3\r\n","input":"15 6 6\r\n2 2 2 3 2 2\r\n3 3 5 2 4 3\r\n","inputFile":"example.01","outputFile":"example.01.a"}],"name":"Рапорт","interaction":null,"memoryLimit":268435456,"tutorial":"Решение на \\textbf{51 балл}: Обе части рапорта можно написать, если ширина левой части рулона не меньше максимальной длины слова в первой части рапорта, \r\nи, аналогично, ширина правой части рулона не меньше максимальной длины слова во второй части рапорта. Переберем положение вертикальной черты, при котором рапорт возможно написать. После этого, проэмулируем процесс написания слов и вычислим длину рулона для данной позиции вертикальной черты. Ответом является минимальная длина рулона по всем положениям черты.\r\n\r\nРешение на \\textbf{100 баллов}:\r\nЗаметим, что при сдвигании вертикальной черты вправо (то есть, при увеличении ширины левой части рулона и уменьшении ширины правой части рулона),\r\nдлина первой части рапорта будет уменьшаться, а длина второй части рапорта будет увеличиваться (длиной части рапорта назовем минимальную длину рулона, \r\nнеобходимую, чтобы написать эту часть рапорта на соответствующей части рулона).\r\n\r\nПоэтому, используя двоичный поиск можно найти две соседних вертикальных черты, что если провести одну из них, левая часть будет длиннее правой, \r\nа если вторую, то наоборот.\r\nЗаметим, что среди ответов для этих двух черт обязательно есть оптимальный ответ.\r\n\r\nДля того, чтобы найти длины частей для определенной черты, нужно просто проэмулировать процесс, добавляя по одному слову.\r\n\r\nИтоговая асимптотика: $O((n + m) \\log w)$."}